Revit 2027 API
StructuralMaterialTypeFilter(StructuralMaterialType, Boolean) Constructor
 Constructs a new instance of a filter to match family instances by structural material type, with the option to match all families which are not of the given structural material type.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StructuralMaterialTypeFilter(
	StructuralMaterialType structuralMaterialType,
	bool inverted
)
Public Sub New (
	structuralMaterialType As StructuralMaterialType,
	inverted As Boolean
)
public:
StructuralMaterialTypeFilter(
	StructuralMaterialType structuralMaterialType,
	bool inverted
)
new :
        structuralMaterialType : StructuralMaterialType *
        inverted : bool -> StructuralMaterialTypeFilter
Parameters
structuralMaterialType StructuralMaterialType
 The structural material type to match.
inverted Boolean
 True if the filter should match all family instances which are not of the given structural material type.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
StructuralMaterialTypeFilter Class
StructuralMaterialTypeFilter Overload
Autodesk.Revit.DB.Structure Namespace